#include <stdio.h>
#include <locale.h>

int main()

{

	setlocale(LC_ALL, "RUS");

	puts("Задание 1 :");

	printf("%20s\n", "Это текст");
	printf("%s\n\t", "Это текст");
	printf("%10.3f\n ", 12.234657);
	printf("%10.5f\n ", 12.234657);
	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2);
	printf("Остаток от деления %d на %d равен %d\n ", 7, 5, 7 % 5);
	printf("умножение %d на %d равен %d\n ", 2000, 4, 2000 * 4);
	printf("%g разделить %e равно %f\n ", 5., 2., 5. / 2);
	printf("%d разделить %d равно %d\n ", 5., 2., 5. / 2);
	printf("%f разделить %f равно %f\n ", 5., 2., 5. / 2);
	printf("%g разделить %g равно %g\n ", 5., 2., 5. / 2);
	printf("%e разделить %e равно %e\n ", 5., 2., 5. / 2);

	puts("Задание 2 :");
	
	int N = 20, K = 15, C = 20;

	printf("Сейчас %d часов %d минут 00 секунд\n", N, K);
	printf("Идёт %d минута суток\n", K);
	printf("До полуночи осталось %d часов и %d минут\n", N, K);
	printf("С 8.00 прошло %d секунд\n", C);
	printf("Текущий час = %d/24 суток и текущаю минута = %d/60 часа\n", N, K);
	printf("Текущий час = %g суток и текущаю минута = %g часа\n", 20. /  24, 15. / 60); 

	puts("Задание 3 :\n\t ");

	printf("%10s\n\t", "Дано:");
	
	int n = 2, k = 3, m = 7;
	printf("%d\n\t", n);
	printf("%d\n", 333);
	printf("%s\n", "Ответ:");
	printf("%+10.7f", n / 333. );
	getchar();

}
